from math import *

a = float(input('Введите a: '))
b = float(input('Введите b: '))
e = 2.718281
x = float(input('Введите х: '))

#№1
# y = log(abs(x)) * (x * atan(a * x) - sqrt(abs(pow(x, 3))) + log(abs(b * x) + 3))

# f = sqrt(a * pow(x, 2) + b * x) - pow(e, (-a * x))
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  8.0 F =  12.806248472804532 Y = -17.706035909884125
# при х =  1.0 F =  1.6499657464017066 Y = 0.0

#№2
# y = pow(x, 5) * (x * atan(a + x) - sqrt(abs(x - a)) + log(pow(abs(x) + 1, 2)))

# f = sqrt(a * pow(x, 2) + b * x) * pow(e, (-a * x)) + log(abs(x) + 1)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  9.5 F =  2.418041142498178 Y = 1213169.6123851433
# при х =  1.5 F =  1.7840836995638187 Y = 18.933531353962042

#№3
# y = pow((x + a), 5) * (atan(x) - sqrt(abs(pow((x - a), 2))) + pow(log(pow(x, 2) + 1), 2))

# f = sin(x) - pow(e, (-a * x)) + log(abs(x - a) + 2)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  8.5 F =  2.8779286537127917 Y = 2237172.0013662917
# при х =  0.5 F =  1.5792149937151898 Y = -361.23392120097657

#№4
# y = pow(x, 5) * (atan(pow((a + x), 2)) - sqrt(abs(pow((x - a), 2))))

# f = sqrt(a * pow(x, 2) + b * x) - pow(e, (-a * x)) + a * x * log(x + a)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  8.0 F =  95.57939119742501 Y = -79827.69786126725
# при х =  1.0 F =  8.480988801328028 Y = -1.4691823603283933

#№5
# y = ((x - a) * atan(a + x) - cbrt(abs(x - a)) + x * log((pow(x, 2) + 2))) 

# f = sqrt(a * pow(x, 2) + b * x) + pow(e, (-a * x)) + log(abs(x) + 4)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  3.5 F =  7.70496482066048 Y = 9.70429682288158
# при х =  1.5 F =  4.25314209956338 Y = -0.15543918926354428

#№6
# y = (pow(x, 5) * cos(a + x) - cbrt(abs(2 * x - a)) + log((pow(x - 2, 2)) + 2))

# f = sqrt(a * pow(x, 2) + b * x) * pow(e, (-a * x)) + log(abs(a - x) + 3)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  3.0 F =  1.386334180312578 Y = 183.03693904419626
# при х =  1.0 F =  1.8366234935118873 Y = 0.122353424236463

#№7
# y = (x * pow(sin(pow(a + x, 2)), 2) - cbrt(abs(x - a)) + log((pow((x - b), 2) + 1)))

# f = sqrt(a * pow(x, 2) + x) + a * pow(e, (-a * x)) + log(abs(1 - x) + 1)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  0.5 F =  2.1823875449102452 Y = -0.4818530463959477
# при х =  1.0 F =  2.0760413463048977 Y = -0.8247754381952495

#№8
# y = log(abs(x + pow(a, 2))) * (a * x * atan(x) - sqrt(abs(x)) + log(abs(b + x) + 1))

# f = sqrt(a * pow(x, 2) + x) + pow(e, (-a * x))
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  4.0 F =  5.293981378838594 Y = 14.03694007518858
# при х =  1.0 F =  1.8042690922387479 Y = 1.289905856992303

#№9
# y = a * pow(x, 5) * (a * x * atan(a + x) - sqrt(abs(x - a)) + log(pow(abs(x) + 1, 2)))

# f = x * sqrt(a * pow(x, 2) + b * x) + pow(e, -x) + log(abs(x - a) + 1)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  5.0 F =  49.65700041318579 Y = 304043.98014435254
# при х =  1.0 F =  3.8567104992863737 Y = 15.881604774906647

#№10
# y = (pow(x + a, 3)) * (atan(a * x) - sqrt(pow(x - a, 2)) + pow(log(a * pow(x, 2) + 1), 2))

# f = sin(a * x) - pow(e, -x) + log(abs(x - a) + 2)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  2.5 F =  2.253193919308306 Y = 24.411550203143257
# при х =  0.5 F =  0.334020387674714 Y = 0.25885150661529704

#№11
# y = log(abs(x - b)) * (a * x * atan(a + x) - sqrt(abs(pow(x, 3) - 1)) + log(abs(b + x) + 1))

# f = 1 + sqrt(a * pow(x, 2) + b) - a * pow(e, (-a * x)) 
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  4.0 F =  5.9460293332417145 Y = 2.647277471297393
# при х =  1.0 F =  2.0795181691412576 Y = -1.8726935213787084

#№12
# y = pow(x, 3) * (x * atan(a/x) - sqrt(abs(x + b)) + log(pow(abs(x - a) + 1, 2)))

# f = sqrt(a * pow(x, 2) + b + x) * pow(e, (-a * x)) + log(abs(x) + 1)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  5.0 F =  1.79179031288872 Y = 296.78427990144854
# при х =  1.5 F =  0.9833266981863295 Y = 4.558682601524822

#№13
# y = (x + a) * (atan(x) - sqrt(abs(pow(x - a, 3))) + log(pow(x, 3) + 1))

# f = sin(x) - pow(e, (-a * x)) + log(abs(x + a) + 2)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  4.5 F =  1.1624126356885787 Y = 12.49577326542988
# при х =  1.5 F =  2.652455964953318 Y = 7.368013983622715

#№14
# y = pow(x, 2) * (atan(pow((a * x + b), 2)) - sqrt(abs(pow((x - a), 2) - b)))

# f = sqrt(a * pow(x, 2) + b + x) - pow(e, (-a +x)) + a * x * log(x + a - 0.5)
# print('при х = ', x,  'F = ', f,'Y =', y)
# # при х =  4.0 F =  12.290456129743689 Y = -5.021957013131118
# при х =  1.0 F =  3.335530603844065 Y = 0.7050342834219475

#№15
# y = ((x - a) * atan(1 / (a + x)) - cbrt(abs(x + a)) + x * log(a + x))

# f = sqrt(a * pow(x, 2) + x) + a * pow(e, (- a * x))  + log(abs(pow(x, 3)) - 3)
# print('при х = ', x,  'F = ', f,'Y =', y)
# при х =  3.0 F =  7.765587038722611 Y = 3.3157333504754845
# при х =  1.5 F =  1.5682347175497755 Y = 0.22170013730266502
